Gov = {
    "中华人民共和国国务院办公厅": "国务院办公厅",
    "国务院办公厅": None,
    "中华人民共和国国务院": "国务院",
    "国务院": None,
    "中央人民政府": None,
    "全国人民代表大会": None,
    "全国人民代表大会常务委员会": None,
}

"""
国务院组成部门
"""
GovDeparments = {
    "中华人民共和国外交部": "外交部",
    "外交部": None,
    "中华人民共和国国防部": "国防部",
    "国防部": None,
    "中华人民共和国国家发展和改革委员会": "国家发展和改革委员会",
    "国家发展和改革委员会": "发展改革委",
    "发展改革委": None,
    "中华人民共和国教育部": "教育部",
    "教育部": None,
    "中华人民共和国科学技术部": "科技部",
    "科技部": None,
    "中华人民共和国工业和信息化部": "工业和信息化部",
    "工业和信息化部": None,
    "中华人民共和国国家民族事务委员会": "国家民委",
    "国家民委": None,
    "中华人民共和国公安部": "公安部",
    "公安部": None,
    "中华人民共和国国家安全部": "安全部",
    "安全部": None,
    "中华人民共和国监察部": "监察部",
    "监察部": None,
    "中华人民共和国民政部": "民政部",
    "民政部": None,
    "中华人民共和国司法部": "司法部",
    "司法部": None,
    "中华人民共和国财政部": "财政部",
    "财政部": None,
    "中华人民共和国人力资源和社会保障部": "人力资源社会保障部",
    "人力资源社会保障部": None,
    "中华人民共和国国土资源部": "国土资源部",
    "国土资源部": None,
    "中华人民共和国环境保护部": "环境保护部",
    "环境保护部": None,
    "中华人民共和国住房和城乡建设部": "住房城乡建设部",
    "住房城乡建设部": None,
    "中华人民共和国交通运输部": "交通运输部",
    "交通运输部": None,
    "中华人民共和国铁道部": "铁道部",
    "铁道部": None,
    "中华人民共和国水利部": "水利部",
    "水利部": None,
    "中华人民共和国农业部": "农业部",
    "农业部": None,
    "中华人民共和国商务部": "商务部",
    "商务部": None,
    "中华人民共和国文化部": "文化部",
    "文化部": None,
    "中华人民共和国卫生部": "卫生部",
    "卫生部": None,
    "中华人民共和国国家人口和计划生育委员会": "人口计生委",
    "人口计生委": None,
    "中国人民银行": "人民银行",
    "人民银行": None,
    "中华人民共和国审计署": "审计署",
    "审计署": None,
}

"""
国务院直属特设机构
"""
OrgSpecailUnderCouncil = {
    "国务院国有资产监督管理委员会": "国资委",
    "国资委": None,
    "中国国家认证认可监督管理委员会": "国家认监委",
    "国家认监委": None,
}

"""
国务院直属机构
"""
OrgDirectlyUnderCouncil = {
    "中华人民共和国海关总署": "海关总署",
    "海关总署": None,
    "国家税务总局": "税务总局",
    "税务总局": None,
    "国家工商行政管理总局": "工商总局",
    "工商总局": None,
    "国家质量监督检验检疫总局": "质检总局",
    "质检总局": None,
    "国家广播电影电视总局": "广电总局",
    "广电总局": None,
    "国家新闻出版总署": "新闻出版总署",
    "新闻出版总署": None,
    "国家版权局": "版权局",
    "版权局": None,
    "国家体育总局": "体育总局",
    "体育总局": None,
    "国家安全生产监督管理总局": "安全监管总局",
    "安全监管总局": None,
    "国家统计局": "统计局",
    "统计局": None,
    "国家林业局": "林业局",
    "林业局": None,
    "国家知识产权局": "知识产权局",
    "知识产权局": None,
    "国家旅游局": "旅游局",
    "旅游局": None,
    "国家宗教事务局": "宗教局",
    "宗教局": None,
    "国务院参事室": "参事室",
    "参事室": None,
    "国务院机关事务管理局": "国管局",
    "国管局": None,
    "国家预防腐败局": "预防腐败局",
    "预防腐败局": None,
}

"""
国务院办事机构
"""
InstuitionGov = {
    "国务院侨务办公室": "侨办",
    "侨办": None,
    "国务院港澳事务办公室": "港澳办",
    "港澳办": None,
    "国务院法制办公室": "法制办",
    "法制办": None,
    "国务院研究室": "国研室",
    "国研室": None,
}

"""
国务院直属事业单位
"""
InstuitionDerictyUnderGov = {
    "新华通讯社(新华社)科学院": "中科院",
    "中科院": None,
    "中国社会科学院": "社科院",
    "社科院": None,
    "中国工程院": "工程院",
    "工程院": None,
    "国务院发展研究中心": "发展研究中心",
    "发展研究中心": None,
    "国家行政学院": "行政学院",
    "行政学院": None,
    "中国地震局": "地震局",
    "地震局": None,
    "中国气象局": "气象局",
    "气象局": None,
    "中国银行业监督管理委员会": "银监会",
    "银监会": None,
    "中国证券监督管理委员会": "证监会",
    "证监会": None,
    "中国保险监督管理委员会": "保监会",
    "保监会": None,
    "国家电力监管委员会": "电监会",
    "电监会": None,
    "全国社会保障基金理事会": "社保基金会",
    "社保基金会": None,
    "国家自然科学基金委员会": "自然科学基金会",
    "自然科学基金会": None,
    "国务院台湾事务办公室": "台办",
    "台办": None,
    "国务院新闻办公室": "新闻办",
    "新闻办": None,
    "国务院防范和处理邪教问题办公室": "防范办",
    "防范办": None,
    "国家档案局": "档案局",
    "档案局": None,
}

"""
国务院部委管理的国家局
"""
GovNationalOffices = {
    "国家信访局": "信访局",
    "信访局": None,
    "国家粮食局": "粮食局",
    "粮食局": None,
    "国家能源局": "能源局",
    "能源局": None,
    "国家国防科技工业局": "国防科工局",
    "国防科工局": None,
    "国家烟草专卖局": "烟草局",
    "烟草局": None,
    "国家外国专家局": "外专局",
    "外专局": None,
    "国家公务员局": "公务员局",
    "公务员局": None,
    "国家海洋局": "海洋局",
    "海洋局": None,
    "国家测绘局": "测绘局",
    "测绘局": None,
    "中国民用航空局": "民航局",
    "民航局": None,
    "国家邮政局": "邮政局",
    "邮政局": None,
    "国家文物局": "文物局",
    "文物局": None,
    "国家食品药品监督管理局": "食品药品监管局",
    "食品药品监管局": None,
    "国家中医药管理局": "中医药局",
    "中医药局": None,
    "国家外汇管理局": "外汇局",
    "外汇局": None,
    "国家煤矿安全监察局": "煤矿安监局",
    "煤矿安监局": None,
    "国家保密局": "保密局",
    "保密局": None,
    "国家密码管理局": "密码局",
    "密码局": None,
    "国家航天局": "航天局",
    "航天局": None,
    "国家原子能机构": "原子能机构",
    "原子能机构": None,
    "国家语言文字工作委员会": "国家语委",
    "国家语委": None,
    "国家核安全局": "核安全局",
    "核安全局": None,
}

"""
Relations
文档间引用关系
"""
Rels = {
    "根据": None,
    "依据": None,
    "颁发": None,
    "实施": None,
    "遵守": None,
    "征集": None,
}


def is_gov(name):
    if name in Gov:
        return True
    if name in GovDeparments:
        return True
    if name in OrgSpecailUnderCouncil:
        return True
    if name in OrgDirectlyUnderCouncil:
        return True
    if name in InstuitionGov:
        return True
    if name in InstuitionDerictyUnderGov:
        return True
    if name in GovNationalOffices:
        return True
    return False